clear all
sympref('AbbreviateOutput', false);

% Продольная координата элемента.
syms x
% Полиномы поля перемещений балочного элемента (без постоянных коэффициентов).
Q = [[1, x, 0, 0,   0,     0]; % Продольное перемещение (tx).
     [0, 0, 1, x, x^2,   x^3]; % Поперечные перемещения (ty).
     [0, 0, 0, 1, 2*x, 3*x^2]] % Поворот сечения (rz).
% Перемещения начала и конца балочного элемента.
syms tx1 ty1 rz1 tx2 ty2 rz2
Z = [tx1, ty1, rz1, tx2, ty2, rz2].'
% Длина элемента.
syms L
% Полиномы для перемещения начала и конца балочного элемента.
C = [subs(Q, x, 0); subs(Q, x, L)]
% Функция формы - Выражение поля перемещений через перемещение 
% начала и конца балочного элемента.
B = Q * C^-1 * Z

% Погонная изгибная жесткость балки.
syms EI
% Погонная осевая жесткость балки.
syms EF
% Потенциальная энергия деформации.
E = EF / 2 * int(diff(B(1),x)^2, x, 0, L) + ...
    EI / 2 * int(diff(B(2),x,2)^2, x, 0, L)
% Приращения энергии деформации балки по координатам.
dE_dz = jacobian(E, Z).'
% Матрица жесткости.
K = [subs(dE_dz, Z, [1, 0, 0, 0, 0, 0].').';
     subs(dE_dz, Z, [0, 1, 0, 0, 0, 0].').';
     subs(dE_dz, Z, [0, 0, 1, 0, 0, 0].').';
     subs(dE_dz, Z, [0, 0, 0, 1, 0, 0].').';
     subs(dE_dz, Z, [0, 0, 0, 0, 1, 0].').';
     subs(dE_dz, Z, [0, 0, 0, 0, 0, 1].').']
