clc
clear all

% Модуль упругости материала.
E = 2.1e+11;
% Площадь сечения.
Fc = 6.4085e-004;
Ft = 7.0e-004;
% Момент инерции сечения для оси z.
Ic = 9.5479e-008;
It = 5.5833e-008;
% Размеры балок.
L1 = 1.4;
L12 = 0.7;
L14 = 0.35;
% Матрица жесткости элемента.
K1 = Stiffness_matrix(E * Fc, E * Ic, L14);
K2 = Stiffness_matrix(E * Fc, E * Ic, L14);
K3 = Stiffness_matrix(E * Fc, E * Ic, L14);
K4 = Stiffness_matrix(E * Fc, E * Ic, L14);
K5 = Stiffness_matrix(E * Ft, E * It, L12);
K6 = Stiffness_matrix(E * Fc, E * Ic, L12);
K7 = Stiffness_matrix(E * Fc, E * Ic, L12);
% Матрицы поворота.
T1 = Rotation_matrix(1, 0);
T2 = Rotation_matrix(1, 0);
T3 = Rotation_matrix(1, 0);
T4 = Rotation_matrix(1, 0);
T5 = Rotation_matrix(0, 1);
T6 = Rotation_matrix(0, 1);
T7 = Rotation_matrix(1, 0);
% Перевод матриц жесткости элементов в глобальную систему координат.
K1 = T1 * K1 * T1.';
K2 = T2 * K2 * T2.';
K3 = T3 * K3 * T3.';
K4 = T4 * K4 * T4.';
K5 = T5 * K5 * T5.';
K6 = T6 * K6 * T6.';
K7 = T7 * K7 * T7.';
% Объединение матриц жесткости в одну, пустые места заполняются нулями.
Z = zeros(6);
Kl = [
    horzcat(K1,  Z,  Z,  Z,  Z,  Z,  Z);
    horzcat( Z, K2,  Z,  Z,  Z,  Z,  Z);
    horzcat( Z,  Z, K3,  Z,  Z,  Z,  Z);
    horzcat( Z,  Z,  Z, K4,  Z,  Z,  Z);
    horzcat( Z,  Z,  Z,  Z, K5,  Z,  Z);
    horzcat( Z,  Z,  Z,  Z,  Z,  K6, Z);
    horzcat( Z,  Z,  Z,  Z,  Z,  Z,  K7);
];
% Построение матрицы связей.
Z = zeros(3);
O = eye(3);

A = [ % Общие узлы  tx1 ty1 rz1 tx2 ty2 rz2 tx3 ty3 rz3 tx4 ty4 rz4 tx5 ty5 rz5 tx6 ty6 rz6 rz6_2 tx7 ty7 rz7 tx8 ty8 rz8
            horzcat(  1,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,    0,  0,  0,  0,  0,  0,  0); % Элемент 1, узел 1. tx1
            horzcat(  0,  1,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,    0,  0,  0,  0,  0,  0,  0); % Элемент 1, узел 1. ty1
            horzcat(  0,  0,  1,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,    0,  0,  0,  0,  0,  0,  0); % Элемент 1, узел 1. rz1
            horzcat(  0,  0,  0,  1,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,    0,  0,  0,  0,  0,  0,  0); % Элемент 1, узел 2. tx2
            horzcat(  0,  0,  0,  0,  1,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,    0,  0,  0,  0,  0,  0,  0); % Элемент 1, узел 2. ty2
            horzcat(  0,  0,  0,  0,  0,  1,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,    0,  0,  0,  0,  0,  0,  0); % Элемент 1, узел 2. rz2
            
            horzcat(  0,  0,  0,  1,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,    0,  0,  0,  0,  0,  0,  0); % Элемент 2, узел 1. tx1
            horzcat(  0,  0,  0,  0,  1,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,    0,  0,  0,  0,  0,  0,  0); % Элемент 2, узел 1. ty1
            horzcat(  0,  0,  0,  0,  0,  1,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,    0,  0,  0,  0,  0,  0,  0); % Элемент 2, узел 1. rz1
            horzcat(  0,  0,  0,  0,  0,  0,  1,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,    0,  0,  0,  0,  0,  0,  0); % Элемент 2, узел 2. tx2
            horzcat(  0,  0,  0,  0,  0,  0,  0,  1,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,    0,  0,  0,  0,  0,  0,  0); % Элемент 2, узел 2. ty2
            horzcat(  0,  0,  0,  0,  0,  0,  0,  0,  1,  0,  0,  0,  0,  0,  0,  0,  0,  0,    0,  0,  0,  0,  0,  0,  0); % Элемент 2, узел 2. rz2

            horzcat(  0,  0,  0,  0,  0,  0,  1,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,    0,  0,  0,  0,  0,  0,  0); % Элемент 3, узел 1. tx1
            horzcat(  0,  0,  0,  0,  0,  0,  0,  1,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,    0,  0,  0,  0,  0,  0,  0); % Элемент 3, узел 1. ty1
            horzcat(  0,  0,  0,  0,  0,  0,  0,  0,  1,  0,  0,  0,  0,  0,  0,  0,  0,  0,    0,  0,  0,  0,  0,  0,  0); % Элемент 3, узел 1. rz1
            horzcat(  0,  0,  0,  0,  0,  0,  0,  0,  0,  1,  0,  0,  0,  0,  0,  0,  0,  0,    0,  0,  0,  0,  0,  0,  0); % Элемент 3, узел 2. tx2
            horzcat(  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  1,  0,  0,  0,  0,  0,  0,  0,    0,  0,  0,  0,  0,  0,  0); % Элемент 3, узел 2. ty2
            horzcat(  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  1,  0,  0,  0,  0,  0,  0,    0,  0,  0,  0,  0,  0,  0); % Элемент 3, узел 2. rz2

            horzcat(  0,  0,  0,  0,  0,  0,  0,  0,  0,  1,  0,  0,  0,  0,  0,  0,  0,  0,    0,  0,  0,  0,  0,  0,  0); % Элемент 4, узел 1. tx1
            horzcat(  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  1,  0,  0,  0,  0,  0,  0,  0,    0,  0,  0,  0,  0,  0,  0); % Элемент 4, узел 1. ty1
            horzcat(  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  1,  0,  0,  0,  0,  0,  0,    0,  0,  0,  0,  0,  0,  0); % Элемент 4, узел 1. rz1
            horzcat(  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  1,  0,  0,  0,  0,  0,    0,  0,  0,  0,  0,  0,  0); % Элемент 4, узел 2. tx2
            horzcat(  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  1,  0,  0,  0,  0,    0,  0,  0,  0,  0,  0,  0); % Элемент 4, узел 2. ty2
            horzcat(  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  1,  0,  0,  0,    0,  0,  0,  0,  0,  0,  0); % Элемент 4, узел 2. rz2

            horzcat(  0,  0,  0,  0,  0,  0,  1,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,    0,  0,  0,  0,  0,  0,  0); % Элемент 5, узел 1. tx1
            horzcat(  0,  0,  0,  0,  0,  0,  0,  1,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,    0,  0,  0,  0,  0,  0,  0); % Элемент 5, узел 1. ty1
            horzcat(  0,  0,  0,  0,  0,  0,  0,  0,  1,  0,  0,  0,  0,  0,  0,  0,  0,  0,    0,  0,  0,  0,  0,  0,  0); % Элемент 5, узел 1. rz1
            horzcat(  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  1,  0,  0,    0,  0,  0,  0,  0,  0,  0); % Элемент 5, узел 2. tx2
            horzcat(  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  1,  0,    0,  0,  0,  0,  0,  0,  0); % Элемент 5, узел 2. ty2
            horzcat(  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  1,    0,  0,  0,  0,  0,  0,  0); % Элемент 5, узел 2. rz2

            horzcat(  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  1,  0,  0,    0,  0,  0,  0,  0,  0,  0); % Элемент 6, узел 1. tx1
            horzcat(  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  1,  0,    0,  0,  0,  0,  0,  0,  0); % Элемент 6, узел 1. ty1
            horzcat(  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,    1,  0,  0,  0,  0,  0,  0); % Элемент 6, узел 1. rz1
            horzcat(  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,    0,  1,  0,  0,  0,  0,  0); % Элемент 6, узел 2. tx2
            horzcat(  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,    0,  0,  1,  0,  0,  0,  0); % Элемент 6, узел 2. ty2
            horzcat(  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,    0,  0,  0,  1,  0,  0,  0); % Элемент 6, узел 2. rz2

            horzcat(  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,    0,  1,  0,  0,  0,  0,  0); % Элемент 7, узел 1. tx1
            horzcat(  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,    0,  0,  1,  0,  0,  0,  0); % Элемент 7, узел 1. ty1
            horzcat(  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,    0,  0,  0,  1,  0,  0,  0); % Элемент 7, узел 1. rz1
            horzcat(  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,    0,  0,  0,  0,  1,  0,  0); % Элемент 7, узел 2. tx2
            horzcat(  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,    0,  0,  0,  0,  0,  1,  0); % Элемент 7, узел 2. ty2
            horzcat(  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,    0,  0,  0,  0,  0,  0,  1); % Элемент 7, узел 2. rz2
            ];

Q = 1.4/2*600/4;
% Глобальная матрица жесткости.
Kglobal = A.' * Kl * A;
% Нагрузки и закрепления (граничные условия).
% NaN - используется для обозначения неизвестных.
%   [Rx1, Ry1, Mz1, Rx2, Ry2, Mz2, Rx3, Ry3, Mz3, Rx4, Ry4, Mz4, Rx5, Ry5, Mz5, Rx6, Ry6, Mz6, Mz6_1, Rx7, Ry7, Mz7, Rx8, Ry8, Mz8] - усилия в узлах.
F = [NaN, NaN, NaN,  0, -600,   0,   0,  -Q,   0,   0,-Q*2,   0,   0,  -Q,   0,1100,   0,   0,     0,   0,   0,-400, NaN, NaN,  0]; 
%   [tx1, ty1, rz1, tx2, ty2, rz2, tx3, ty3, rz3] - перемещения узлов.
U = [  0,   0,   0, NaN, NaN, NaN, NaN, NaN, NaN, NaN, NaN, NaN, NaN, NaN, NaN, NaN, NaN, NaN,   NaN, NaN, NaN, NaN,   0,   0, NaN]; 
% Индексы неизвестных усилий.
F_unknown = find(isnan(F));
% Индексы известных перемещений.
U_known = F_unknown;
% Выделение коэффициентов при неизвестных в отдельную матрицу.
A = Kglobal;
A(:, F_unknown) = 0;
for i = 1:length(F_unknown)
    A(F_unknown(i), F_unknown(i)) = -1;
end
% Выделение известных величин в отдельную матрицу.
B = F;
B(U_known) = U(U_known);
% Решение системы уравнений.
result = linsolve(A, B.');
Rx1 = result(1)
Ry1 = result(2)
Mz1 = result(3)
tx2 = result(4)
ty2 = result(5)
rz2 = result(6)
tx3 = result(7)
ty3 = result(8)
rz3 = result(9)
tx4 = result(10)
ty4 = result(11)
rz4 = result(12)
tx5 = result(13)
ty5 = result(14)
rz5 = result(15)
tx6 = result(16)
ty6 = result(17)
rz6 = result(18)
rz6_1 = result(19)
tx7 = result(20)
ty7 = result(21)
rz7 = result(22)
Rx8 = result(23)
Ry8 = result(24)
rz8 = result(25)

% Матрица жесткости элемента.
function K = Stiffness_matrix(EF, EI, L)
    K = [[ EF/L,            0,           0, -EF/L,            0,           0];
         [    0,  (12*EI)/L^3,  (6*EI)/L^2,     0, -(12*EI)/L^3,  (6*EI)/L^2];
         [    0,   (6*EI)/L^2,    (4*EI)/L,     0,  -(6*EI)/L^2,    (2*EI)/L];
         [-EF/L,            0,           0,  EF/L,            0,           0];
         [    0, -(12*EI)/L^3, -(6*EI)/L^2,     0,  (12*EI)/L^3, -(6*EI)/L^2];
         [    0,   (6*EI)/L^2,    (2*EI)/L,     0,  -(6*EI)/L^2,    (4*EI)/L]];
end

% Матрица поворота вокруг оси z.
function Tz = Rotation_matrix(COS, SIN)
    Tz = [[  COS, -SIN,    0,    0,    0,    0];
          [  SIN,  COS,    0,    0,    0,    0];
          [    0,    0,    1,    0,    0,    0];
          [    0,    0,    0,  COS, -SIN,    0];
          [    0,    0,    0,  SIN,  COS,    0];
          [    0,    0,    0,    0,    0,    1]];
end
